
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.АиФ_ДвиженияМСФО.Записывать = Истина;
	Движения.АиФ_ДвиженияМСФО.Очистить();

	Для Каждого Строка Из Строки Цикл

		Если Не ЗначениеЗаполнено(Строка.Сумма) И Не ЗначениеЗаполнено(Строка.СуммаВГО) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.АиФ_ДвиженияМСФО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтатьяМСФО = Строка.СтатьяМСФО;
		Движение.ВидОперации = ВидОперации;
		Движение.КодСчетаБП = Строка.КодСчетаБП;
		Движение.Контрагент = Строка.Контрагент;
		Движение.Сумма = Строка.Сумма;
		Движение.СуммаВГО = Строка.СуммаВГО;
		Движение.Содержание = Строка.Содержание;
		Движение.ОбъектАналитики = Строка.ОбъектАналитики;

	КонецЦикла;

КонецПроцедуры
